docs/Books/how_to_read_a_book.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-09-10 Fri 14:55 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>How To Read A Book</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="chrischen" />
<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css">
</head>
<body>
<div id="content">
<h1 class="title">How To Read A Book</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org7da8b08">1. Why should we read?</a></li>
<li><a href="#orgdb0bfff">2. Four Levels of Reading</a></li>
<li><a href="#org6deeb09">3. Inspectional Reading</a></li>
<li><a href="#org50f605b">4. Analytical Reading</a></li>
<li><a href="#org9818ed5">5. Syntoptical Reading</a></li>
<li><a href="#org5e75f36">6. How to Read Different Genres</a></li>
</ul>
</div>
</div>
<div id="outline-container-org7da8b08" class="outline-2">
<h2 id="org7da8b08"><span class="section-number-2">1</span> Why should we read?</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>For entertainment and access to information</li>
<li>To increase understanding of a certain topic</li>
<li><b>To expand the mind</b></li>
</ul>
</div>
</div>

<div id="outline-container-orgdb0bfff" class="outline-2">
<h2 id="orgdb0bfff"><span class="section-number-2">2</span> Four Levels of Reading</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Elementary reading</li>
<li><b>Inspectional reading</b> involves systematic skimming or prereading.</li>
<li><b>Analytical reading</b> involves comprehensive and complete reading.</li>
<li>Syntopical reading</li>
</ul>
</div>
</div>

<div id="outline-container-org6deeb09" class="outline-2">
<h2 id="org6deeb09"><span class="section-number-2">3</span> Inspectional Reading</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Systemmatic skimming: Title -&gt; Preface -&gt; Table of Contents -&gt; Index &amp; Publisher's blurb.</li>
<li>Reading through the book quickly. (<b>without stopping</b>)</li>
</ul>
</div>
</div>

<div id="outline-container-org50f605b" class="outline-2">
<h2 id="org50f605b"><span class="section-number-2">4</span> Analytical Reading</h2>
<div class="outline-text-2" id="text-4">
<p>
Three stages:
</p>
<ul class="org-ul">
<li>Finding out what a book is talking about
<ol class="org-ol">
<li>Identify the type of the book. Theoretical?Practical?Others?</li>
<li>Discover the theme of the book, and then summarize the entirety of its main contents.</li>
<li>Find out the structure of the book and draw its mind map or outline. (not necessarily follow its original structure)</li>
<li>Find out the questions the author is trying to ask or solve.</li>
</ol></li>

<li>Understanding the specific content of the book
<ol class="org-ol">
<li>Find the most important <b>keywords</b> in the book and understand the precise meaning behind them.</li>
<li>Highlight the important sentences and discover its main idea.</li>
<li>Organize the author's points in order and use notes to reconstruct the chain of causality.</li>
<li>To determine which questions the author has indeed solved.</li>
</ol></li>

<li>Fairly judge a book</li>
</ul>
</div>
</div>

<div id="outline-container-org9818ed5" class="outline-2">
<h2 id="org9818ed5"><span class="section-number-2">5</span> Syntoptical Reading</h2>
<div class="outline-text-2" id="text-5">
<p>
Involve selecting and reading related books covering the same topic in order to obtain a comprehensive understanding of an issue.
</p>
<ol class="org-ol">
<li>Use inspectional reading to find relevant passages.</li>
<li>Understand the answers of different authors to the same question.</li>
<li>Clarify the problem and list the questions that interest you most.</li>
<li>Define the issues in which we are discussing.</li>
<li>Analyze and discuss, understand the key points of each answer.</li>
</ol>
</div>
</div>

<div id="outline-container-org5e75f36" class="outline-2">
<h2 id="org5e75f36"><span class="section-number-2">6</span> How to Read Different Genres</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li><b>Practical books</b> tell us how to do something</li>
<li>Fictional literature</li>
<li>Theoretical Books
<ul class="org-ul">
<li>Historical bookes: 1. read more than one book on the event 2. focus on understanding the reason behind the history</li>
<li>Scientific books: General readers can understand most of these books through analytical reading.</li>
<li>Philosophical books: It is important for us to understand the questions the author intends to answer.</li>
</ul></li>
</ul>
</div>
</div>
</div>
</body>
</html>
